[
    {
        "name": "Rolex",
        "price": " 280.00",
        "img": "https://i.ibb.co/rm8Ks1t/p1.jpg",
        "description": "Up there in the most well-known of watch brands, Rolex watches are continually and constantly a hot commodity. Their value holds—and most often increases—years after purchase. This is true of almost all styles.Deep Discounts On Authentic Luxury Watches, Sunglasses, Handbags & More. Expert Service. Save Up To 65% On Huge Selection of Top Brands! Fast, Free Shipping & Warranty Included. 20+ Years Online. Authenticity Guaranteed"
    },
    {
        "name": "Tag Heuer",
        "price": " 280.00",
        "img": "https://i.ibb.co/48t8Hjd/p2.jpg",
        "description": "TAG Heuer S.A. is a Swiss luxury watchmaker that designs, manufactures and markets watches and fashion accessories, as well as eyewear and mobile phones manufactured under license by other companies and carrying theLargely thought of as the premier sports watchmaker—driving, soccer, diving, etc. "
    },
    {
        "name": "Cartier",
        "price": " 280.00",
        "img": "https://i.ibb.co/RQgTFht/p3.jpg",
        "description": "Similar to their jewelry, Cartier’s cult classics have been a celebrity and watch-buyer favorite for decades. Watch models get an update every few years to keep them cutting edge.Many Cartier watches retain their value and several will go on to be worth more on the pre-owned market than when they were first purchased. The brand has spared no expense when creating these luxury commodities"
    },
    {
        "name": "Grand Seiko",
        "price": " 480.00",
        "img": "https://i.ibb.co/rm8Ks1t/p1.jpg",
        "description": "This Japanese watchmaker is a bit of a sleeper brand. The watches have a lot to pay attention to, however: good looks, stellar craftsmanship, and not too spendy.Is Grand Seiko a good watch.Grand Seiko models' build quality exceeds many luxurious watchmaking Swiss brands and is at par with some of the top Swiss high-end luxury watches. Over the years, Rolex has upgraded and updated its models."
            },
    {
        "name": "Hermès",
        "price": " 380.00",
        "img": "https://i.ibb.co/r6ndznH/p5.jpg",
        "description": "Hermès International S.A., or simply Hermès, is a French luxury goods manufacturer established in 1837. It specializes in leather goods, lifestyle accessories.The French luxury brand has a way with watches as well. The models are an extension of what they do so well: refined and timeless"
    },
    {
        "name": "Omega",
        "price": " 500.00",
        "img": "https://i.ibb.co/7pYbStC/p6.jpg",
        "description": " Classic and sporty options from the official timekeeper of the Olympics, the partner of most every recent James Bond, Exclusivity​ Swiss made watches represent pure exclusivity in Omega. Also, the wonderful luxury Omega watches, have unique materials, movements, designs, and other factors that make them expensive"
    },
    {
        "name": "PRX",
        "price": " 350.00",
        "img": "https://i.ibb.co/hfg1gtN/p7.jpg",
        "description": "PowerWatch is equipped with a MATRIX-powered thermoelectric engine that is one-of-a-kind"
    },
    {
        "name": "Nomos Glashütte",
        "price": " 150.00",
        "img": "https://i.ibb.co/tchKJh4/p8.jpg",
        "description": "Clean and crisp in design, the Nomos Glashütte watch brand offers designs that are quiet and won’t compete with an outfit.Noted for its Bauhaus-inspired design, NOMOS watches are minimalist, perfectly executed and offer some of the best value around. While the brand does produce some more complicated pieces, it's the dress watches in particular that are arguably among the best value in the world"
    },
    {
        "name": "Longines",
        "price": " 280.00",
        "img": "https://i.ibb.co/8mxkQqT/p9.jpg",
        "description": "There’s plenty of history in the almost two hundred years of watchmaking from Longines. The brand has equally petite and chunky styles to offer.Compagnie des Montres Longines, Francillon S.A., or simply Longines, is a Swiss luxury watchmaker based in Saint-Imier, Switzerland. Founded by Auguste Agassiz in 1832, the company has been a subsidiary of the Swiss Swatch Group and its predecessors since 1983"
    },
    {
        "name": "Van Cleef & Arpels",
        "price": " 180.00",
        "img": "https://i.ibb.co/Fbp18rm/10.jpg",
        "description": "Watches as jewelry is how many people style their Van Cleef & Arpels pieces. The storied jewelry recently leaned into this philosophy with a watch pendant as an extension of their quintessential Alhambra line.Van Cleef & Arpels are known for their elegant designs and timeless nature of each and every piece they create. The collection has developed and grown over the years, showcasing a variety of models, using some of the most precious metals and stones"
    }
]